app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-01-26 19:49:14.627422"], ["id", 1]]
---
  def update
    # raise params.inspect
    @article = Article.find(params[:id])
    #@article.update(title: params[:title], description: params[:description])
    #puts @article
    @article.title = params[:title]
    @article.save